Revit 2024 API
BuiltInFailures.DimensionFailures.LabelingDimWithGroupReferences Property
 Labeled constraints cannot participate in groups.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LabelingDimWithGroupReferences { get; }
Visual Basic
Public Shared ReadOnly Property LabelingDimWithGroupReferences As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LabelingDimWithGroupReferences {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace